# BIG DATA / DATA SCIENCE

## Seminario: Ejercicios resueltos en Python

### Ejercicio 1 - Cadenas de texto

Dada la siguiente frase:

In [1]:
conjunto_frases = "frase uno, frase dos, frase tres, frase cuatro   "

Obtén un subconjunto de la frase que en la que se hayan borrado los espacios del final, se muestre la primera letra con mayúscula, en lugar de 'frase' que aparezca 'mensaje' y además, separar las frases en sub-cadenas a través de las comas.

#### Solución

In [10]:
clean_sentence = conjunto_frases.strip().replace("frase", "mensaje").capitalize().split(",")

clean_sentence

['Mensaje uno', ' mensaje dos', ' mensaje tres', ' mensaje cuatro']

### Ejercicio 2 - Cadenas de texto, condicionales

Escribir un programa que teniendo en cuenta una contraseña ya almacenada, solicite al usuario que ingrese una contraseña, en caso de ser iguales, le daremos la bienvenida, en caso contrario mostraremos un mensaje de contraseña incorrecta.

NOTA: Es importante que estandaricemos las cadenas de texto a minúsculas.

#### Solución

In [20]:
password = " PEPE "

contraseña_solicitada = input("Por favor, ingrese contraseña: \n")

print(contraseña_solicitada)

if contraseña_solicitada.lower().strip() == password.lower().strip():
    print("Bienvenido!")
    print(contraseña_solicitada.lower() + " - " + password.lower())
else:
    print(contraseña_solicitada.lower() + " - " + password.lower())
    print("Contraseña Incorrecta")

Por favor, ingrese contraseña:
pepe
pepe
Bienvenido!
pepe -  pepe

In [17]:
"Pepe".lower()

'pepe'

### Ejercicio 3 - Condicionales

tomar como referencia los siguientes tramos impositivos en la campaña de la renta:

|         Renta          | Tipo impositivo |
| :--------------------: | :-------------: |
|    Menos de 10000€     |       5%        |
| Entre 10000€ y 20000€  |       15%       |
| Entre 20000€ y 35000€ |       20%       |
| Entre 35000€ y 60000€ |       30%       |
|     Más de 60000€      |       45%       |

Escribir un programa que pregunte al usuario su renta anual y muestre por pantalla el tipo impositivo que le corresponde.

#### Solución

In [35]:
renta = int(input("¿Cuál es su renta anual? "))

if int(renta) < 10000:
    print("Tipo impositivo = 5 % ", renta * 0.05)
    print("Neto: ", renta - (renta *0.05))
    
elif renta >= 10000 and renta < 20000:
    print("Tipo impositivo = 15 % ", renta * 0.15)
    print("Neto: ", renta - (renta * 0.15))
    
elif renta >= 20000 and renta < 35000:
    print("Tipo impositivo = 20 % ", renta * 0.20)
    print("Neto: ", renta - (renta * 0.20))
    
elif renta >= 35000 and renta < 60000:
    print("Tipo impositivo = 30 % ", renta * 0.30)
    print("Neto: ", renta - (renta * 0.30))
    
else:
    print("Tipo impositivo = 45 % ", renta * 0.45)
    print("Neto: ", renta - (renta * 0.45))

¿Cuál es su renta anual? 100000
Tipo impositivo = 45 %  45000.0
Neto:  55000.0

### Ejercicio 4 - Estructuras de datos

Escribe un programa que solicite al usuario una frase, después, genere un diccionario de datos en el que los campos clave sean las palabras y, los campos valor el número de veces que aparece dicha palabra en la frase

#### Solución

In [36]:
frase = input("Introduce una frase: ")

Introduce una frase: bueno bueno bueno pero que me que  me que me dices

In [37]:
frase.split()

['bueno',
 'bueno',
 'bueno',
 'pero',
 'que',
 'me',
 'que',
 'me',
 'que',
 'me',
 'dices']

In [38]:
frase.count("bueno")

3

In [57]:
newdict = {}

newdict["pepe"] = "capullo"

newdict

{'pepe': 'capullo'}

In [40]:
my_dict = {}

In [59]:
for item in frase.split(" "):
    print(item)
    if item not in my_dict.keys():
        my_dict[item] = frase.count(item)
    else:
        pass # No hacer nada

my_dict

bueno
bueno
bueno
pero
que
me
que

me
que
me
dices

{'bueno': 3, 'pero': 1, 'que': 3, 'me': 3, '': 51, 'dices': 1}

### Ejercicio 5 - Pandas

Se utilizará una base de datos (en .csv) procedente de la web https://openflights.org/data.html , el dataset contiene la siguiente información:
* **AirportID**: Identificador de cada vuelo para un aeropuerto.
* **Name**: Nombre del aeropuerto.
* **City**: Ciudad en la que se encuentra el aeropuerto.
* **Country**: País o territorio en el que se encuentra el aeropuerto.
* **IATA**: Código de asociación internacional de transporte aéreo, código del aeorpuerto.
* **ICAO**: Código de organización civil internacional, código de aeoropuertto.
* **Latitude**: Coordenada del aeropuerto (latitud).
* **Longitude**: Coordenada del aeropuerto (longitud).
* **Altitude**: Altitud del aeropuerto (en pies).
* **Timezone**: Zona horaria.
* **DST**: Código referente al continente (Daylight savings time). Europe (E), A (US/CANADA), S (South America), O (Australia), Z (New Zeeland), N (None), U (Unknown).
* **Tz**: Zona horaria del aeropuerto. Por ejemplo: (America/Los_Angeles).
* **Type**: Tipo de aeropuerto: airport, station, port, unknown.
* **Source**: Fuente de datos.

Con la información del dataset realizar lo siguiente: 
* 1 Carga del dataset como dataframe.
* 2 Muestra las primeras 10 filas del dataframe.
* 3 Obtén un resumen estadístico.
* 4 Para este análisis no vamos a emplear las columnas 'AirportID', 'Latitude', 'Longitude' y 'Altitude', elimínalas del dataframe.
* 5 Vuelve a obtener un resumen estadístico, ¿de qué forma han cambiado los datos?.
* 6 Sobre el resumen estadístico anterior parece que en la columna TZ hay un valor raro \N, revisa la proporción de los mismos con value_counts.
* 7 Vuelve a cargar el dataset de modo que se interpreten correctamente los valores nulos (repite el apartado 4, borra las columnas).
* 8 Revisa los valores nulos de todo el dataframe.
* 9 Sobrescribe los valores nulos de las columnas IATA e ICAO por el valor 'DESCONOCIDO'
* 10 Cambia el tipo de las variables DST y TZ como categórico.
* 11 Obtén un resumen estadístico de las variables categóricas.
* 12 Agrupa el dataframe por el tipo de aeropuerto, mostrando el conteo de los tipos.
* 13 Selecciona el nombre de las ciudades cuyo tipo de aeropuerto sea "port"
* 14 Muestra todas las filas de los campos nombre del aeropuerto, nombre del país y, nombre de la ciudad, cuyo país sea Spain.
* 15 Muestra el nombre del país y del aeropuerto que sean pertenecientes de la ciudad de Madrid y Barcelona. ¿Todos los registros son de España?
* 16 Guarda los resultados anteriores en un csv llamado Madrid_Barcelona.csv

* 1 Carga del dataset como dataframe. (clickamos con el segundo boton en el enlace _airports-extended.dat_ y seleccionamos "guardar contenido del enlace como", a continuación cambiamos la extensión de dat a csv)

In [93]:
import pandas as pd

df = pd.read_csv("C:/Users/David/Downloads/airports-extended.csv", header= None)

In [94]:
df.columns = ["AirportID","Name","City","Country","IATA","ICAO","Latitude","Longitude","Altitude","Timezone","DST","Tz","Type","Source"]

* 2 Muestra las primeras 10 filas del dataframe.

In [95]:
df.head(10)

,AirportID,Name,City,Country,IATA,ICAO,Latitude,Longitude,Altitude,Timezone,DST,Tz,Type,Source
0,1,Goroka Airport,Goroka,Papua New Guinea,GKA,AYGA,-6.081690,145.391998,5282,10,U,Pacific/Port_Moresby,airport,OurAirports
1,2,Madang Airport,Madang,Papua New Guinea,MAG,AYMD,-5.207080,145.789001,20,10,U,Pacific/Port_Moresby,airport,OurAirports
2,3,Mount Hagen Kagamuga Airport,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826790,144.296005,5388,10,U,Pacific/Port_Moresby,airport,OurAirports
3,4,Nadzab Airport,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569803,146.725977,239,10,U,Pacific/Port_Moresby,airport,OurAirports
4,5,Port Moresby Jacksons International Airport,Port Moresby,Papua New Guinea,POM,AYPY,-9.443380,147.220001,146,10,U,Pacific/Port_Moresby,airport,OurAirports
5,6,Wewak International Airport,Wewak,Papua New Guinea,WWK,AYWK,-3.583830,143.669006,19,10,U,Pacific/Port_Moresby,airport,OurAirports
6,7,Narsarsuaq Airport,Narssarssuaq,Greenland,UAK,BGBW,61.160500,-45.425999,112,-3,E,America/Godthab,airport,OurAirports
7,8,Godthaab / Nuuk Airport,Godthaab,Greenland,GOH,BGGH,64.190903,-51.678101,283,-3,E,America/Godthab,airport,OurAirports
8,9,Kangerlussuaq Airport,Sondrestrom,Greenland,SFJ,BGSF,67.012222,-50.711603,165,-3,E,America/Godthab,airport,OurAirports
9,10,Thule Air Base,Thule,Greenland,THU,BGTL,76.531197,-68.703201,251,-4,E,America/Thule,airport,OurAirports

* 3 Obtén un resumen estadístico.

In [96]:
df.describe() # solo muestra las numéricas

          AirportID      Latitude     Longitude      Altitude
count  12668.000000  12668.000000  12668.000000  12668.000000
mean    7311.584465     29.820510     -1.041145    831.871093
std     4202.520098     26.923942     83.618663   1498.239733
min        1.000000    -90.000000   -179.876999  -1266.000000
25%     3349.750000     16.115875    -77.294770     38.000000
50%     7771.500000     38.341850      6.955411    232.500000
75%    10943.250000     49.306042     47.835824    883.500000
max    14111.000000     90.000000    179.951004  14472.000000

In [97]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12668 entries, 0 to 12667
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   AirportID  12668 non-null  int64
 1   Name       12668 non-null  object
 2   City       12619 non-null  object
 3   Country    12668 non-null  object
 4   IATA       12668 non-null  object
 5   ICAO       12667 non-null  object
 6   Latitude   12668 non-null  float64
 7   Longitude  12668 non-null  float64
 8   Altitude   12668 non-null  int64
 9   Timezone   12668 non-null  object
 10  DST        12668 non-null  object
 11  Tz         12668 non-null  object
 12  Type       12668 non-null  object
 13  Source     12668 non-null  object
dtypes: float64(2), int64(2), object(10)
memory usage: 1.4+ MB

In [98]:
df.describe(include="object")

,Name,City,Country,IATA,ICAO,Timezone,DST,Tz,Type,Source
count,12668,12619,12668,12668,12667,12668,12668,12668,12668,12668
unique,12330,9673,241,6925,8161,42,8,312,5,4
top,North Sea,New York,United States,\N,\N,1,E,\N,airport,OurAirports
freq,21,50,2708,5744,4507,2706,3478,4282,8264,7698

* 4 Para este análisis no vamos a emplear las columnas 'AirportID', 'Latitude', 'Longitude' y 'Altitude', elimínalas del dataframe.

In [99]:
df.columns

Index(['AirportID', 'Name', 'City', 'Country', 'IATA', 'ICAO', 'Latitude',
       'Longitude', 'Altitude', 'Timezone', 'DST', 'Tz', 'Type', 'Source'],
      dtype='object')

In [100]:
df.drop(['AirportID', 'Latitude', 'Longitude', 'Altitude'], axis = 1, inplace= True)
# inplace = True sirve para que no tenga que guardar los cambios en una nueva variable

df.columns

Index(['Name', 'City', 'Country', 'IATA', 'ICAO', 'Timezone', 'DST', 'Tz',
       'Type', 'Source'],
      dtype='object')

* 5 Vuelve a obtener un resumen estadístico, ¿de qué forma han cambiado los datos?.

In [101]:
df.describe() # ahora no hay numéricas, todas son categóricasºb

,Name,City,Country,IATA,ICAO,Timezone,DST,Tz,Type,Source
count,12668,12619,12668,12668,12667,12668,12668,12668,12668,12668
unique,12330,9673,241,6925,8161,42,8,312,5,4
top,North Sea,New York,United States,\N,\N,1,E,\N,airport,OurAirports
freq,21,50,2708,5744,4507,2706,3478,4282,8264,7698

In [102]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12668 entries, 0 to 12667
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      12668 non-null  object
 1   City      12619 non-null  object
 2   Country   12668 non-null  object
 3   IATA      12668 non-null  object
 4   ICAO      12667 non-null  object
 5   Timezone  12668 non-null  object
 6   DST       12668 non-null  object
 7   Tz        12668 non-null  object
 8   Type      12668 non-null  object
 9   Source    12668 non-null  object
dtypes: object(10)
memory usage: 989.8+ KB

* 6 Sobre el resumen estadístico anterior parece que en la columna TZ hay un valor raro \N, revisa la proporción de los mismos con value_counts.

In [105]:
df["Tz"].value_counts()
df.Tz.value_counts()

\N                    4282
America/New_York       705
America/Chicago        402
Europe/Berlin          323
America/Anchorage      265
                      ...
Europe/Kaliningrad       1
Africa/Bujumbura         1
Africa/Banjul            1
Indian/Mayotte           1
Europe/Andorra           1
Name: Tz, Length: 312, dtype: int64

* 7 Vuelve a cargar el dataset de modo que se interpreten correctamente los valores nulos (repite el apartado 4, borra las columnas).

In [106]:
df = pd.read_csv("C:/Users/David/Downloads/airports-extended.csv", header= None, na_values= "\\N")
df.columns = ["AirportID","Name","City","Country","IATA","ICAO","Latitude","Longitude","Altitude","Timezone","DST","Tz","Type","Source"]
df.drop(['AirportID', 'Latitude', 'Longitude', 'Altitude'], axis = 1, inplace= True)

df.describe()

           Timezone
count  12315.000000
mean       0.273126
std        5.545574
min      -12.000000
25%       -5.000000
50%        1.000000
75%        3.000000
max       13.500000

In [107]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12668 entries, 0 to 12667
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      12668 non-null  object
 1   City      12619 non-null  object
 2   Country   12668 non-null  object
 3   IATA      6924 non-null   object
 4   ICAO      8160 non-null   object
 5   Timezone  12315 non-null  float64
 6   DST       12315 non-null  object
 7   Tz        8386 non-null   object
 8   Type      11017 non-null  object
 9   Source    11017 non-null  object
dtypes: float64(1), object(9)
memory usage: 989.8+ KB

Al reconocer los valores \N  como nulos, el resto de datos de la columna Timezone me los interpreta como números.

In [108]:
df.Tz.value_counts()

America/New_York      705
America/Chicago       402
Europe/Berlin         323
America/Anchorage     265
Europe/Paris          241
                     ...
Europe/Kaliningrad      1
Africa/Bujumbura        1
Africa/Banjul           1
Indian/Mayotte          1
Europe/Andorra          1
Name: Tz, Length: 311, dtype: int64

In [109]:
df.describe(include="object")

,Name,City,Country,IATA,ICAO,DST,Tz,Type,Source
count,12668,12619,12668,6924,8160,12315,8386,11017,11017
unique,12330,9673,241,6924,8160,7,311,4,3
top,North Sea,New York,United States,GKA,AYGA,E,America/New_York,airport,OurAirports
freq,21,50,2708,1,1,3478,705,8264,7698

* 8 Revisa los valores nulos de todo el dataframe.

In [111]:
df.isna().sum()

Name           0
City          49
Country        0
IATA        5744
ICAO        4508
Timezone     353
DST          353
Tz          4282
Type        1651
Source      1651
dtype: int64

* 9 Sobrescribe los valores nulos de las columnas IATA e ICAO por el valor 'DESCONOCIDO'

In [112]:
df.IATA = df.IATA.fillna("DESCONOCIDO")

In [113]:
df.IATA.value_counts()

DESCONOCIDO    5744
GKA               1
DGE               1
CES               1
GUL               1
               ...
JGA               1
JLR               1
IDR               1
GOI               1
CPO               1
Name: IATA, Length: 6925, dtype: int64

In [114]:
df.ICAO = df.ICAO.fillna("DESCONOCIDO")

df.ICAO.value_counts()

DESCONOCIDO    4508
AYGA              1
YTWB              1
SDAM              1
SULO              1
               ...
SVLO              1
SVLF              1
SVJM              1
SVJC              1
UKDM              1
Name: ICAO, Length: 8161, dtype: int64

* 10 Cambia el tipo de las variables DST y TZ como categórico.

In [115]:
df.DST = pd.Categorical(df.DST)
df.Tz = pd.Categorical(df.Tz)

In [116]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12668 entries, 0 to 12667
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      12668 non-null  object
 1   City      12619 non-null  object
 2   Country   12668 non-null  object
 3   IATA      12668 non-null  object
 4   ICAO      12668 non-null  object
 5   Timezone  12315 non-null  float64
 6   DST       12315 non-null  category
 7   Tz        8386 non-null   category
 8   Type      11017 non-null  object
 9   Source    11017 non-null  object
dtypes: category(2), float64(1), object(7)
memory usage: 839.9+ KB

* 11 Obtén un resumen estadístico de las variables categóricas.

In [117]:
df.describe(include= "category")

          DST                Tz
count   12315              8386
unique      7               311
top         E  America/New_York
freq     3478               705

* 12 Agrupa el dataframe por el tipo de aeropuerto, mostrando el conteo de los tipos.

In [124]:
df.groupby(["Type"]).count() # obtenemos lo mismo que con value_counts()
# algunas columnas muestran valores diferentes porque contienen valores nulos.

         Name  City  Country  IATA  ICAO  Timezone   DST    Tz  Source
Type
airport  8264  8215     8264  8264  8264      7911  7911  7148    8264
port      101   101      101   101   101       101   101    66     101
station  1332  1332     1332  1332  1332      1332  1332   414    1332
unknown  1320  1320     1320  1320  1320      1320  1320   758    1320

In [126]:
# como no tiene sentido mostrar todas las columnas con los mismos valores, 
# elegimos una que no tenga nulos

df.groupby(["Type"]).count()["Name"]

Type
airport    8264
port        101
station    1332
unknown    1320
Name: Name, dtype: int64

In [125]:
df.Type.value_counts()

airport    8264
station    1332
unknown    1320
port        101
Name: Type, dtype: int64

In [118]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12668 entries, 0 to 12667
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      12668 non-null  object
 1   City      12619 non-null  object
 2   Country   12668 non-null  object
 3   IATA      12668 non-null  object
 4   ICAO      12668 non-null  object
 5   Timezone  12315 non-null  float64
 6   DST       12315 non-null  category
 7   Tz        8386 non-null   category
 8   Type      11017 non-null  object
 9   Source    11017 non-null  object
dtypes: category(2), float64(1), object(7)
memory usage: 839.9+ KB

In [122]:
df[:3]

,Name,City,Country,IATA,ICAO,Timezone,DST,Tz,Type,Source
0,Goroka Airport,Goroka,Papua New Guinea,GKA,AYGA,10.0,U,Pacific/Port_Moresby,airport,OurAirports
1,Madang Airport,Madang,Papua New Guinea,MAG,AYMD,10.0,U,Pacific/Port_Moresby,airport,OurAirports
2,Mount Hagen Kagamuga Airport,Mount Hagen,Papua New Guinea,HGU,AYMH,10.0,U,Pacific/Port_Moresby,airport,OurAirports

* 13 Selecciona el nombre de las ciudades cuyo tipo de aeropuerto sea "port"

In [132]:
df[(df["Type"] == "port")][["City", "Type"]][:5]
# si indexamos varias columnas, tenemos que seleccionarlas usando una lista, 
# sino, con un corchete sería suficiente

             City  Type
6074        Macau  port
6438    Stockholm  port
6439  Helsingborg  port
6444     Helsinki  port
6565  Sakaiminato  port

* 14 Muestra todas las filas de los campos nombre del aeropuerto, nombre del país y, nombre de la ciudad, cuyo país sea Spain.

In [134]:
df[(df["Country"] == "Spain")][["Name", "Country", "City"]]

                                         Name Country                    City
1030                    Fuerteventura Airport   Spain           Fuerteventura
1031                           Hierro Airport   Spain                  Hierro
1032                         La Palma Airport   Spain  Santa Cruz De La Palma
1033                     Gran Canaria Airport   Spain            Gran Canaria
1034                        Lanzarote Airport   Spain                Arrecife
...                                       ...     ...                     ...
11437                     Madrid Estacion Sur   Spain                  Madrid
11438                     Granada Bus Station   Spain                 Granada
11879       Palma de Mallorca Cruise Terminal   Spain       Palma de Mallorca
12234                      Algeciras Heliport   Spain               Algeciras
12386  Región de Murcia International Airport   Spain                  Murcia

[145 rows x 3 columns]

* 15 Muestra el nombre del país y del aeropuerto que sean pertenecientes de la ciudad de Madrid y Barcelona. ¿Todos los registros son de España?

In [144]:
# no nos sirve la condición or para filtrar, debemos usar el operador | 

df[(df.City == "Madrid") | (df.City =="Barcelona")][["Country", "Name", "City", "Type"]]

,Country,Name,City,Type
1188,Spain,Barcelona International Airport,Barcelona,airport
1194,Spain,Getafe Air Base,Madrid,airport
1198,Spain,Adolfo Suárez Madrid–Barajas Airport,Madrid,airport
1214,Spain,Torrejón Airport,Madrid,airport
1217,Spain,Cuatro Vientos,Madrid,unknown
2690,Venezuela,General José Antonio Anzoategui International ...,Barcelona,airport
6302,Spain,Barcelona Cruise Terminal,Barcelona,unknown
8046,Spain,Atocha,Madrid,unknown
8053,Spain,Chamartin Station,Madrid,station
8055,Spain,Aeroport,Barcelona,unknown
8056,Spain,Passeig de Gracia,Barcelona,unknown
8057,Spain,Sants,Barcelona,unknown
8846,Spain,Barajas Station,Madrid,station
9156,Spain,Aeropuerto T4 Madrid Metro,Madrid,unknown
10033,Spain,Estacio de Franca,Barcelona,unknown
10264,Spain,Placa d Espanya Station,Barcelona,station
10435,Spain,Cuatro Vientos Airport,Madrid,airport
11435,Spain,Barcelona-Sants,Barcelona,NaN
11437,Spain,Madrid Estacion Sur,Madrid,NaN

* 16 Guarda los resultados anteriores en un csv llamado Madrid_Barcelona.csv

In [145]:
results = df[(df.City == "Madrid") | (df.City =="Barcelona")][["Country", "Name", "City", "Type"]]

In [146]:
results.to_csv("C:/Users/David/Downloads/Madrid_Barcelona.csv")